package 브루트_포스;
//https://www.acmicpc.net/problem/28215


public class 대피소_28215 {

}
/*
2차원 평면 KOI 마을에 N개의 집이 있다. 각 i 번째 집의 위치는 (Xi, Yi) 이다.
i번쨰 집과 j번쨰 집 사이의 거리는 |Xi - Xj| + |Yi - Yj| 이다. 즉, 두 집 사이의 거리는 X의 차이와 Y 의 차이의 합임. 예를 들어, (1,6) 에 위치한 집과 (2,4) 에 위치한 집은 (2 - 1) + (6 - 4) 인 3만큼 떨어져 있다.

KOI 마을은 재난 발생 시 주민들이 안전하게 대피할 수 있도록 K개의 집에 대피소를 설치할 계획이다. 모든 주민의 안전을 고려하여, 집에서 가장 가까운 대피소로 이동할 때 가장 긴 거리가 최소가 되도록 대피소를 설치할 K개의 집을 선택하고,
그 때 대피소와 가장 멀리 떨어진 집과의 거리를 구하려고 한다.

아래는 5개의 집이 각각 (1, 5), (3, 0), (3, 3), (6, 12), (8, 9) 에 위치한 마을의 예이다.
 */